<h2><span style="color: #0000ff;">Antecedentes hist&oacute;ricos</span></h2>

<p>Para realizar el estudio de la evoluci&oacute;n del computador, varios autores se refieren a generaciones, mismas que van creciendo conforme avanza la tecnología. En la actualidad, se pueden encontrar recursos que hacen menci&oacute;n de 6 a 7 generaciones.</p>

<p>En este curso, nos basaremos en los eventos que han marcado puntos estrat&eacute;gicos para la evoluci&oacute;n del computador, as&iacute;&nbsp;tenemos: Antecesores del computador, las primeras computadoras, cambios de tecnolog&iacute;a relacionadas con sus circuitos, uso de Internet.</p>

<p></p>
<p><strong><span style="color: #3366ff;">Antecesores de las computadoras</span><br /><br /></strong><span style="color: #000000;">Desde muchos a&ntilde;os, la necesidad del hombre por hacer cuentas, permiti&oacute; que se vayan inventando formas de facilitar la realizaci&oacute;n de c&aacute;lculos matem&aacute;ticos, empezando por contar con los dedos, piedras, avanzando a inventar el &aacute;baco, pascalina, y un sinn&uacute;mero de instrumentos&nbsp;para satisfacer estas necesidades que tambi&eacute;n han evolucionado desde simples c&aacute;lculos matem&aacute;ticos hasta realizar inferencias (razonamiento) como lo tenemos en la actualidad.</span></p>

<p><span style="color: #000000;">A continuaci&oacute;n, se resume la evoluci&oacute;n del computador en un audiovisual de alrededor de 4 minutos, mismo que contiene informaci&oacute;n muy relevante de c&oacute;mo han ido avanzando la computaci&oacute;n.</span></p>
<iframe class=»youtube-player» type=»text/html» width=»846″ height=»484″ src=https://www.youtube.com/embed/0Ilqo4iyjW8 frameborder=»0″></iframe>
<p><span style="color: #3366ff;"><strong>Caracter&iacute;sticas de las primeras computadoras</strong></span></p>

<p>Durante la Segunda Guerra Mundial se crean los primeros computadores electr&oacute;nicos, mismos que ten&iacute;an las caracter&iacute;sticas comunes, tales como:</p>

<ul>

<li>Ocupaban gran espacio f&iacute;sico, necesitaban una habitaci&oacute;n completa.</li>

<li>Eran muy pesadas, varias toneladas.</li>

<li>La tecnolog&iacute;a utilizada era de v&aacute;lvulas de vac&iacute;o.</li>

<li>Su costo era tan elevado que solamente pod&iacute;an ser financiadas por los gobiernos.</li>

<li>Se constru&iacute;an para fines espec&iacute;ficos.</li>

<li>Realizaban operaciones de c&aacute;lculo, por ejemplo para calcular trayectorias de misiles.</li>

<li>No dispon&iacute;an de monitor.</li>

<li>Consum&iacute;an mucha electricidad y se calentaban mucho.</li>

</ul>

<p><img src="../../../../../static/Eniac.jpg" alt="" type="saveimage" target="[object Object]" preventdefault="function(){r.isDefaultPrevented=n}" stoppropagation="function(){r.isPropagationStopped=n}" stopimmediatepropagation="function(){r.isImmediatePropagationStopped=n}" isdefaultprevented="function t(){return!1}" ispropagationstopped="function t(){return!1}" isimmediatepropagationstopped="function t(){return!1}" width="709" height="542" /></p>
