<h2><span style="color: #0000ff;">Definiciones b&aacute;sicas</span></h2>

<div align="center"><span style="color: #0000ff;"><img src="../../../../../static/15266.jpg" alt="" type="saveimage" target="[object Object]" preventdefault="function(){r.isDefaultPrevented=n}" stoppropagation="function(){r.isPropagationStopped=n}" stopimmediatepropagation="function(){r.isImmediatePropagationStopped=n}" isdefaultprevented="function t(){return!1}" ispropagationstopped="function t(){return!1}" isimmediatepropagationstopped="function t(){return!1}" width="591" height="418" /></span></div>

<p></p>

<div align="center"></div>

<p></p>

<p><strong><span style="color: #0000ff;">Redes de computadoras</span></strong></p>

<p>"Las redes de ordenadores actuales son una amalgama de dispositivos, t&eacute;cnicas y sistemas de comunicaci&oacute;n que han ido apareciendo desde finales del siglo XIX o, lo que es lo mismo, desde la invenci&oacute;n del tel&eacute;fono. El tel&eacute;fono, que se desarroll&oacute; exclusivamente para transmitir voz, hoy se utiliza, en muchos casos, para conectar ordenadores entre s&iacute;. Desde entonces han aparecido las redes locales, las conexiones de datos a larga distancia con enlaces transoce&aacute;nicos o sat&eacute;lites, la telefon&iacute;a m&oacute;vil, etc. Menci&oacute;n especial merece la red Internet dentro de este mundo de las comunicaciones a distancia. Nadie duda de que hoy en d&iacute;a constituye una red b&aacute;sica de comunicaci&oacute;n entre los humanos." (Perramon et al., 2004)</p>

<p></p>

<p><span style="color: #3366ff;"><strong>Definici&oacute;n de red de computadoras</strong></span></p>

<p>Una red de computadoras (red de ordenadores o red inform&aacute;tica), es un <strong><span style="color: #ff6600;">conjunto de equipos</span> <span style="color: #ff6600;">conectados</span></strong> por medio de cables, se&ntilde;ales, ondas o cualquier otro m&eacute;todo de transporte de datos, que <strong><span style="color: #339966;">comparten informaci&oacute;n</span></strong> (archivos), <strong><span style="color: #339966;">recursos</span></strong> (CD-ROM, impresoras, etc.) y <strong><span style="color: #339966;">servicios</span></strong> (acceso a internet, e‐mail, chat, juegos), etc.</p>

<p>Seg&uacute;n Beekman y Martin (2005) la importancia de una red de computadores, gira en torno a los tres elementos de su anatom&iacute;a b&aacute;sica:&nbsp;</p>

<ul>

<li><span style="color: #3366ff;"><strong>Hardware</strong></span>:&nbsp;ya que es posible&nbsp;compartir recursos de hardware de la computadora, <strong>reduci&eacute;ndose los costes</strong> y haciendo posible a m&aacute;s personas beneficiarse de la <strong>potencia del equipamiento inform&aacute;tico</strong>.</li>

<li><span style="color: #3366ff;"><strong>Software</strong></span>: que es el que hace posible compartir datos y programas, increment&aacute;ndose la <strong>eficacia</strong> y la <strong>productividad</strong>.</li>

<li><span style="color: #3366ff;"><strong>Personas</strong></span>: porque gracias a las redes, es posible&nbsp;que las <strong>personas trabajen juntas</strong>, o colaboren, de formas que de otro modo ser&iacute;a dif&iacute;cil o imposible.</li>

</ul>

<p></p>

<p>Como un dato importante, se debe&nbsp;se&ntilde;alar que una&nbsp;red de computadoras se diferencia de una <strong><span style="color: #3366ff;">red&nbsp;de comunicaciones</span></strong>, pues es&nbsp;un conjunto de <strong><span style="color: #3366ff;">medios t&eacute;cnicos</span></strong> que permiten la comunicaci&oacute;n a distancia entre equipos aut&oacute;nomos.<br /><br /></p>

<p>A continuaci&oacute;n, se presenta un recurso audiovisual, el mismo que explica de manera muy gr&aacute;fica, el funcionamiento de una red, a pesar de que se ha grabado en el 2011, sigue vigente el funcionamiento, lo que ha cambiado hoy en d&iacute;a, es el medio de transmisi&oacute;n.</p>
<iframe class=»youtube-player» type=»text/html» width=»846″ height=»484″ src=https://www.youtube.com/embed/D8YG2zfdag0 frameborder=»0″></iframe>
<p><span style="color: #3366ff;"><strong>Comunicaci&oacute;n</strong></span>: es el proceso que lleva un mensaje de un emisor a trav&eacute;s de un canal a un receptor. En una red, los ordenadores son emisores y receptores al mismo tiempo. El canal es el medio por el que circulan los datos: cables, fibra,...</p>

<p><span style="color: #3366ff;"><strong>Protocolo</strong></span>: Es el lenguaje y el conjunto de&nbsp; reglas por las que emisor y receptor se&nbsp; comunican. El protocolo m&aacute;s utilizado es el de internet: <strong>TCP/IP</strong></p>

<p><span style="color: #3366ff;"><strong>Direcci&oacute;n IP (Internet Protocol)</strong></span>:<strong>&nbsp;</strong>Significa &laquo;Protocolo de Internet&rdquo;. Este protocolo, al igual que otros muchos como HTTP, TCP, UDP, etc., se encarga de establecer las comunicaciones en la mayor&iacute;a de nuestras redes. Para ello, asigna una direcci&oacute;n &uacute;nica e irrepetible a cada dispositivo que trata de comunicarse en Internet. Est&aacute;n construidas en cuatro bloques num&eacute;ricos. Cada bloque es un n&uacute;mero del 0 al 255 y est&aacute; separado por un punto ".". Por ejemplo, 63.45.12.34 (IP p&uacute;blica) y&nbsp; 192.168.0.11 (IP privada).</p>

<p><span style="color: #3366ff;"><strong>DNS (Sistema de Nombres por Dominio)</strong></span>: Las direcciones IP son dif&iacute;ciles de recordar. Por ello se utiliza el DNS, que traducen las direcciones IP en nombres&nbsp; f&aacute;ciles para nosotros (Ej:www.google.ec). Los servidores DNS utilizados por defecto son los proporcionados por el ISP con el que se contrata el servicio (movistar, claro, ...). Tambi&eacute;n hay DNS libres como las nuevas DNS libres de Google 8.8.8.8 y 8.8.8.4 que pueden sustituir a las DNS de nuestros proveedores&nbsp;en el caso de tener problemas de navegaci&oacute;n.</p>

<p><span style="color: #3366ff;"><strong>Puerto</strong></span>: Interfaz para comunicarse con un programa a trav&eacute;s de la red. Ejemplo: el servicio http utiliza el puerto 80.</p>
