<h2><strong><span style="color: #3366ff;">Introducci&oacute;n</span></strong></h2>

<p>Hasta nuestros d&iacute;as, los cient&iacute;ficos no han llegado a un consenso sobre la definici&oacute;n de Inteligencia Artificial, por tanto no podemos expresar con exactitud cu&aacute;ndo una aplicaci&oacute;n es o no inteligente, problema que parte desde que no hay una defici&oacute;n clara para "inteligencia" (no artificial)</p>

<p>Se conoce que los humanos somos inteligentes por el hecho de saber resolver problemas, comunicarnos, inventar, etc... pero a&uacute;n existen algunos comportamientos que indican que algunos animales (mascotas especialmente) son inteligentes y capaces de expresar sentimientos. Esto complica a&uacute;n m&aacute;s poner un l&iacute;mite entre lo que es inteligente y no inteligente.</p>

<p>Alan Turing, es un matem&aacute;tico quien hizo un primer intento por definir la IA, se lo considera como el "padre de la computaci&oacute;n". Este cient&iacute;fico plante&oacute; una prueba denominada Test de Turing, mismo que permit&iacute;a afirmar si una m&aacute;quina es o no inteligente. Para llegar a esa conclusi&oacute;n el test hace lo siguiente:</p>

<p>Un ser humano se comunicar&iacute;a a trav&eacute;s de un terminal inform&aacute;tico con una entidad que se hallar&iacute;a en una habitaci&oacute;n contigua. Dicha entidad podr&iacute;a ser un humano o una m&aacute;quina inteligente. Si en la conversaci&oacute;n una persona no es capaz de distinguir si en la habitaci&oacute;n contigua est&aacute; o un humano o una m&aacute;quina, entonces en el caso de que sea una m&aacute;quina, &eacute;sta ser&iacute;a inteligente.</p>

<div align="center"><img src="Hasta nuestros d&iacute;as, los cient&iacute;ficos no han llegado a un consenso sobre la definici&oacute;n de Inteligencia Artificial, por tanto no podemos expresar con exactitud cu&aacute;ndo una aplicaci&oacute;n es o no inteligente, problema que parte desde que no hay una defici&oacute;n clara para &quot;inteligencia&quot; (no artificial)  Se conoce que los humanos somos inteligentes por el hecho de saber resolver problemas, comunicarnos, inventar, etc... pero a&uacute;n existen algunos comportamientos que indican que algunos animales (mascotas especialmente) son inteligentes y capaces de expresar sentimientos. Esto complica a&uacute;n m&aacute;s poner un l&iacute;mite entre lo que es inteligente y no inteligente.  Alan Turing, es un matem&aacute;tico quien hizo un primer intento por definir la IA, se lo considera como el &quot;padre de la computaci&oacute;n&quot;. Este cient&iacute;fico plante&oacute; una prueba denominada Test de Turing, mismo que permit&iacute;a afirmar si una m&aacute;quina es o no inteligente. Para llegar a esa conclusi&oacute;n el test hace lo siguiente:  Un ser humano se comunicar&iacute;a a trav&eacute;s de un terminal inform&aacute;tico con una entidad que se hallar&iacute;a en una habitaci&oacute;n contigua. Dicha entidad podr&iacute;a ser un humano o una m&aacute;quina inteligente. Si en la conversaci&oacute;n una persona no es capaz de distinguir si en la habitaci&oacute;n contigua est&aacute; o un humano o una m&aacute;quina, entonces en el caso de que sea una m&aacute;quina, &eacute;sta ser&iacute;a inteligente." alt="" type="saveimage" target="[object Object]" preventdefault="function(){r.isDefaultPrevented=n}" stoppropagation="function(){r.isPropagationStopped=n}" stopimmediatepropagation="function(){r.isImmediatePropagationStopped=n}" isdefaultprevented="function t(){return!1}" ispropagationstopped="function t(){return!1}" isimmediatepropagationstopped="function t(){return!1}" /><img src="../static/Prueba_Turing.jpg" alt="" type="saveimage" target="[object Object]" preventdefault="function(){r.isDefaultPrevented=n}" stoppropagation="function(){r.isPropagationStopped=n}" stopimmediatepropagation="function(){r.isImmediatePropagationStopped=n}" isdefaultprevented="function t(){return!1}" ispropagationstopped="function t(){return!1}" isimmediatepropagationstopped="function t(){return!1}" width="419" height="411" /></div>

<p></p>
<iframe class=»youtube-player» type=»text/html» width=»846″ height=»484″ src=https://www.youtube.com/embed/_peHYwe_784 frameborder=»0″></iframe>
<h2><strong><span style="color: #3366ff;">Definiciones</span></strong></h2>

<p>Russel Norvin propone cuatro aproximaciones de la definici&oacute;n de IA, que siguen diferentes puntos de vista, influenciados por otras ramas de la ciencia como Filosof&iacute;a, Matem&aacute;ticas, Psicolog&iacute;a, Biolog&iacute;a, y son:</p>

<ul>

<li><strong>Sistemas que act&uacute;an como humanos:</strong></li>

</ul>

<p style="padding-left: 30px;">El estudio de c&oacute;mo lograr que los ordenadores realicen tareas que, de momento, la gente hace mejor (Rich y Knight, 1991)</p>

<p style="padding-left: 30px;">El modelo es el hombre, el objetivo es construir un sistema que pase por humano. Esto implica que si pasa la prueba de Turing, el sistema es inteligente.&nbsp; Para lograr este objetivo se necesita de:&nbsp; Procesamiento del Lenguaje Natural, Representaci&oacute;n del Conocimiento, Razonamiento, Aprendizaje Autom&aacute;tico. La interacci&oacute;n de programas con personas hace que sea importante que &eacute;stos puedan actuar como humanos.</p>

<ul>

<li><strong>Sistemas que piensan como humanos:</strong></li>

</ul>

<p style="padding-left: 30px;">El esfuerzo de hacer que los computadores piensen &hellip; m&aacute;quinas con mentes en el m&aacute;s amplio sentido literal (Haugeland, 1985)</p>

<p style="padding-left: 30px;">En este caso el modelo es el funcionamiento de la mente humana, al intentar establecer una teor&iacute;a sobre el funcionamiento de la mente (experimentaci&oacute;n psicol&oacute;gica) para que a partir de la teor&iacute;a se puedan establecer modelos computacionales. Por tanto, este enfoque tiene mucha influencia de las Ciencias Cognitivas.</p>

<ul>

<li><strong>Sistemas que piensan racionalmente:</strong></li>

</ul>

<p style="padding-left: 30px;">El estudio de las facultades mentales a trav&eacute;s del estudio de modelos computacionales (Charniak y McDermott, 1985)</p>

<p style="padding-left: 30px;">Este enfoque se&nbsp;basa en las leyes del pensamiento racional misas que tienen su fundamento en en la l&oacute;gica (silogismos de Arist&oacute;teles). Seg&uacute;n &eacute;sto, la l&oacute;gica formal es la&nbsp;base de los programas inteligentes (logicismo). Ante esta propuesta se presentan dos obst&aacute;culos: la complejidad de formalizar el conocimiento y la distancia que separa la capacidad te&oacute;rica de la l&oacute;gica y su realizaci&oacute;n pr&aacute;ctica.</p>

<ul>

<li><strong>Sistemas que act&uacute;an racionalmente:</strong></li>

</ul>

<p style="padding-left: 30px;">El estudio que busca explicar y emular el comportamiento inteligente en t&eacute;rminos de procesos computacionales (Shalkoff, 1990)</p>

<p style="padding-left: 30px;">Actuar racionalmente significa conseguir unos objetivos dadas unas creencias. El paradigma es el agente racional, que se aplica, por ejemplo, a muchos sistemas rob&oacute;ticos. Un agente percibe y act&uacute;a, siempre teniendo en cuenta el entorno en el que est&aacute; situado, necesita capacidad como: percepci&oacute;n, procesamiento de lenguaje natural, representaci&oacute;n de conocimiento, razonamiento, aprendizaje autom&aacute;tico.</p>

<p>La IA sigue avanzando, pero a&uacute;n existe el dilema de si realmente la IA es posible, ya que plantea algunos problemas filos&oacute;ficos complejos tales como si las m&aacute;quinas inteligentes tienen conciencia, o si&nbsp;&nbsp;la inteligencia una propiedad emergente de los elementos biol&oacute;gicos que la producen...</p>

<p>Luego de revisar estas propuestas, desarrolle su propia definici&oacute;n de IA.</p>

<p></p>
