<link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/bootstrap/4.4.1/css/bootstrap.min.css" integrity="sha384-Vkoo8x4CGsO3+Hhxv8T/Q5PaXtkKtu6ug5TOeNV6gBiFeWPGFN9MuhOf23Q9Ifjh" crossorigin="anonymous">
<style type="text/css">
.botones{
border-radius: 23px;
}
</style>
<div class ="container">
<div class="row justify-content-center">
<div class="btn-group btn-group-lg col-6 p-0 my-4 border border-dark botones" role="group" aria-label="Toolbar with button groups">
<a class="btn btn-outline-dark border-0 col-4" href="definiciones-de-ia.html" data-toggle="button" aria-pressed="false" autocomplete="off">Page</a>
<a class="btn btn-outline-dark border-0 col-4" href="definiciones-de-ia-1.html" data-toggle="button" aria-pressed="false" autocomplete="off">Video</a>
<a class="btn btn-outline-dark border-0 col-4" href="definiciones-de-ia-2.html" data-toggle="button" aria-pressed="false" autocomplete="off">Page</a>
</div><br><br>
</div>
<h2><strong><span style="color: #3366ff;">Introducci&oacute;n</span></strong></h2>

<p>Hasta nuestros d&iacute;as, los cient&iacute;ficos no han llegado a un consenso sobre la definici&oacute;n de Inteligencia Artificial, por tanto no podemos expresar con exactitud cu&aacute;ndo una aplicaci&oacute;n es o no inteligente, problema que parte desde que no hay una defici&oacute;n clara para "inteligencia" (no artificial)</p>

<p>Se conoce que los humanos somos inteligentes por el hecho de saber resolver problemas, comunicarnos, inventar, etc... pero a&uacute;n existen algunos comportamientos que indican que algunos animales (mascotas especialmente) son inteligentes y capaces de expresar sentimientos. Esto complica a&uacute;n m&aacute;s poner un l&iacute;mite entre lo que es inteligente y no inteligente.</p>

<p>Alan Turing, es un matem&aacute;tico quien hizo un primer intento por definir la IA, se lo considera como el "padre de la computaci&oacute;n". Este cient&iacute;fico plante&oacute; una prueba denominada Test de Turing, mismo que permit&iacute;a afirmar si una m&aacute;quina es o no inteligente. Para llegar a esa conclusi&oacute;n el test hace lo siguiente:</p>

<p>Un ser humano se comunicar&iacute;a a trav&eacute;s de un terminal inform&aacute;tico con una entidad que se hallar&iacute;a en una habitaci&oacute;n contigua. Dicha entidad podr&iacute;a ser un humano o una m&aacute;quina inteligente. Si en la conversaci&oacute;n una persona no es capaz de distinguir si en la habitaci&oacute;n contigua est&aacute; o un humano o una m&aacute;quina, entonces en el caso de que sea una m&aacute;quina, &eacute;sta ser&iacute;a inteligente.</p>

<div align="center"><img src="Hasta nuestros d&iacute;as, los cient&iacute;ficos no han llegado a un consenso sobre la definici&oacute;n de Inteligencia Artificial, por tanto no podemos expresar con exactitud cu&aacute;ndo una aplicaci&oacute;n es o no inteligente, problema que parte desde que no hay una defici&oacute;n clara para &quot;inteligencia&quot; (no artificial)  Se conoce que los humanos somos inteligentes por el hecho de saber resolver problemas, comunicarnos, inventar, etc... pero a&uacute;n existen algunos comportamientos que indican que algunos animales (mascotas especialmente) son inteligentes y capaces de expresar sentimientos. Esto complica a&uacute;n m&aacute;s poner un l&iacute;mite entre lo que es inteligente y no inteligente.  Alan Turing, es un matem&aacute;tico quien hizo un primer intento por definir la IA, se lo considera como el &quot;padre de la computaci&oacute;n&quot;. Este cient&iacute;fico plante&oacute; una prueba denominada Test de Turing, mismo que permit&iacute;a afirmar si una m&aacute;quina es o no inteligente. Para llegar a esa conclusi&oacute;n el test hace lo siguiente:  Un ser humano se comunicar&iacute;a a trav&eacute;s de un terminal inform&aacute;tico con una entidad que se hallar&iacute;a en una habitaci&oacute;n contigua. Dicha entidad podr&iacute;a ser un humano o una m&aacute;quina inteligente. Si en la conversaci&oacute;n una persona no es capaz de distinguir si en la habitaci&oacute;n contigua est&aacute; o un humano o una m&aacute;quina, entonces en el caso de que sea una m&aacute;quina, &eacute;sta ser&iacute;a inteligente." alt="" type="saveimage" target="[object Object]" preventdefault="function(){r.isDefaultPrevented=n}" stoppropagation="function(){r.isPropagationStopped=n}" stopimmediatepropagation="function(){r.isImmediatePropagationStopped=n}" isdefaultprevented="function t(){return!1}" ispropagationstopped="function t(){return!1}" isimmediatepropagationstopped="function t(){return!1}" /><img src="../../../../../static/Prueba-Turing.jpg" alt="" type="saveimage" target="[object Object]" preventdefault="function(){r.isDefaultPrevented=n}" stoppropagation="function(){r.isPropagationStopped=n}" stopimmediatepropagation="function(){r.isImmediatePropagationStopped=n}" isdefaultprevented="function t(){return!1}" ispropagationstopped="function t(){return!1}" isimmediatepropagationstopped="function t(){return!1}" width="419" height="411" /></div>

<p></p>
<script src="https://code.jquery.com/jquery-3.4.1.slim.min.js" integrity="sha384-J6qa4849blE2+poT4WnyKhv5vZF5SrPo0iEjwBvKU7imGFAV0wwj1yYfoRSJoZ+n" crossorigin="anonymous"></script>
<script src="https://cdn.jsdelivr.net/npm/popper.js@1.16.0/dist/umd/popper.min.js" integrity="sha384-Q6E9RHvbIyZFJoft+2mJbHaEWldlvI9IOYy5n3zV9zzTtmI3UksdQRVvoxMfooAo" crossorigin="anonymous"></script>
<script src="https://stackpath.bootstrapcdn.com/bootstrap/4.4.1/js/bootstrap.min.js" integrity="sha384-wfSDF2E50Y2D1uUdj0O3uMBJnjuUD4Ih7YwaYd1iqfktj0Uod8GCExl3Og8ifwB6" crossorigin="anonymous"></script>